Revit 2024 API
ImageTypeOptions.Resolution Property
 The Resolution of the image is expressed in dots-per-inch and hence determines the size of a pixel in the image.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public double Resolution { get; set; }
Visual Basic
Public Property Resolution As Double
	Get
	Set
Visual C++
public:
property double Resolution {
	double get ();
	void set (double value);
}
Remarks
 For raster based image formats (*.bmp, *.jpg, *.jpeg, *.png, *.tif) the Resolution is used to calculate the size of the image from the number of pixels in the horizontal and vertical directions.
 For PDF files, which have a known paper size, the Resolution is used to control the amount of detail to capture in the image. Increasing the Resolution of PDF based images will add more detail to the image, but will also increase the amount of data stored in the project file.
 The default value of this property is 72 dpi.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The given value for resolution must be positive.
See Also
ImageTypeOptions Class
Autodesk.Revit.DB Namespace